In [1]:
import pandas as pd
import numpy as np

In [2]:
customers = pd.read_csv('customers.csv')
orders = pd.read_csv('orders.csv')
order_items = pd.read_csv('order_items.csv')

In [4]:
customers.sort_values('last_name').head()

     customer_id first_name last_name      city
31          1032       Noah     Brown        LA
112         1113      Maria     Brown       NYC
97          1098        Zoe      Chen        LA
53          1054        Zoe     Davis  New York
32          1033       alex     Davis   chicago

In [7]:
orders.sort_values('order_date', ascending=False)

     order_id  customer_id  order_date
213      5214         1075  2024-03-31
383      5384         1111  2024-03-31
215      5216         1103  2024-03-31
207      5208         1023  2024-03-30
14       5015         1019  2024-03-30
..        ...          ...         ...
430      5431         1006  2024-01-01
271      5272         1004  2024-01-01
56       5057         1019  2024-01-01
13       5014         1090  2024-01-01
246      5247         1017  2024-01-01

[450 rows x 3 columns]

In [9]:
ny_customers = customers[customers['city'].str.lower().isin(['new york', 'nyc'])]
ny_customers.head()

    customer_id first_name last_name      city
0          1001       Evan     Smith  New York
3          1004      Aisha     Smith  new york
5          1006       Evan     Patel  new york
7          1008      Maria     Smith       NYC
10         1011        Ben     Davis  New York

In [11]:
recent_orders = orders[orders['order_date'] > '2024-02-14']
recent_orders.head()

    order_id  customer_id  order_date
1       5002         1045  2024-02-20
5       5006         1031  2024-03-10
7       5008         1061  2024-03-08
9       5010         1054  2024-03-24
12      5013         1074  2024-02-16

In [15]:
order_items[order_items['quantity'] >= 2].sort_values

<bound method DataFrame.sort_values of      order_id product_name  quantity  unit_price
0        5311      Monitor         3         300
1        5303     Keyboard         3          70
2        5012     Keyboard         3          70
3        5318      Monitor         3         300
6        5339    Desk Lamp         2          45
..        ...          ...       ...         ...
891      5021    Desk Lamp         2          45
893      5107      Monitor         3         300
895      5303    USB Cable         2          10
896      5117      Monitor         2         300
898      5399    USB Cable         2          10

[464 rows x 4 columns]>

In [16]:
customers['first_name '] = customers['first_name'].str.strip().str.capitalize()
customers['last_name '] = customers['last_name'].str.strip().str.capitalize()

In [19]:
customers['city'].value_counts()

city
LA             24
New York       22
chicago        17
Los Angeles    17
new york       15
NYC            15
Chicago        10
Name: count, dtype: int64

In [21]:
city_stand_map = {'LA' : 'Los Angeles', 'NYC' : 'New York'}

In [23]:
customers['city'] = customers['city'].replace(city_stand_map)

In [24]:
customers['city'] = customers['city'].str.title()

In [26]:
customers['clean_last_name'] = customers['last_name'].apply(
    lambda x:
    x.strip()
)

In [27]:
customers['clean_last_name'].value_counts()

clean_last_name
Davis       19
Smith       18
Patel       17
Brown       16
Chen        16
Anderson    13
Wilson      13
Lopez        8
Name: count, dtype: int64

# Merging Tables

In [30]:
orders_with_customers = orders.merge(customers, how='inner')
orders_with_customers.head()

,order_id,customer_id,order_date,first_name,last_name,city,first_name,last_name,clean_last_name
0,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith
1,5002,1045,2024-02-20,Priya,Davis,New York,Priya,Davis,Davis
2,5003,1004,2024-02-14,Aisha,Smith,New York,Aisha,Smith,Smith
3,5004,1036,2024-02-13,Chloe,Davis,New York,Chloe,Davis,Davis
4,5005,1070,2024-01-05,jordan,Brown,Los Angeles,Jordan,Brown,Brown

In [32]:
orders_customers_items = orders_with_customers.merge(order_items, on = 'order_id', how= 'inner')
orders_customers_items.head()

,order_id,customer_id,order_date,first_name,last_name,city,first_name,last_name,clean_last_name,product_name,quantity,unit_price
0,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith,Monitor,1,300
1,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith,Desk Lamp,2,45
2,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith,Desk Lamp,1,45
3,5002,1045,2024-02-20,Priya,Davis,New York,Priya,Davis,Davis,Monitor,2,300
4,5002,1045,2024-02-20,Priya,Davis,New York,Priya,Davis,Davis,Monitor,2,300

In [34]:
combined = (
    orders.merge(customers, on='customer_id', how='inner').merge(order_items, on='order_id', how='inner')
)
combined.head()

,order_id,customer_id,order_date,first_name,last_name,city,first_name,last_name,clean_last_name,product_name,quantity,unit_price
0,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith,Monitor,1,300
1,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith,Desk Lamp,2,45
2,5001,1089,2024-01-26,Aisha,Smith,New York,Aisha,Smith,Smith,Desk Lamp,1,45
3,5002,1045,2024-02-20,Priya,Davis,New York,Priya,Davis,Davis,Monitor,2,300
4,5002,1045,2024-02-20,Priya,Davis,New York,Priya,Davis,Davis,Monitor,2,300

Grouping and Aggregation

In [37]:
order_items['total_price'].sum()

KeyError: 'total_price'

In [39]:
order_items.groupby('product_name')['total_price'].sum().sort_values(ascending=False)

KeyError: 'Column not found: total_price'

In [40]:
order_items.groupby('product_name')['quantity'].sum().sort_values(ascending=False)

product_name
Monitor      300
Mouse        270
USB Cable    257
Laptop       247
Desk Lamp    239
Keyboard     202
Name: quantity, dtype: int64

In [ ]:
order_items.groupby('product_name').agg(
    total_revenue=('total_price', 'sum'),
    avg_quantity=('quantity', 'mean')
)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1594527052.py, line 2)

In [43]:
combined.groupby('customer_id')['total_price'].sum().head()

KeyError: 'Column not found: total_price'

In [44]:
sample = combined[['customer_id', 'product_name', 'total_price']]

KeyError: "['total_price'] not in index"

In [ ]:
pivot = sample.pivot_table(index='customer_id',  columns = "product_name",
                            values="total_price", aggfunc="sum")

In [ ]:
combined.query('quantity >= 2').groupby('city').agg(total_revenue=('total_price', 'sum')).sort_values('total_value', ascending=False)